app/views/wikis/index.html.erb

<div class='wiki-index'>
	<% Wiki.all.each do |wiki| %>
---
SELECT "wikis".* FROM "wikis"