app/controllers/wikis_controller.rb

INSERT INTO "wikis" ("title", "body", "private", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Moose"], ["body", "Big horns"], ["private", "f"], ["user_id", 1], ["created_at", "2015-11-24 07:40:53.916815"], ["updated_at", "2015-11-24 07:40:53.916815"]]
---
	def create
		@user = current_user
		@wiki = @user.wikis.build(wiki_params)

		if @wiki.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@wiki = Wiki.find(params[:id])

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]
---
	def destroy
		@wiki = Wiki.find(params[:id])

		if @wiki.destroy

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@wiki = Wiki.find(params[:id])

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "wikis" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "Zebras..."], ["body", "false"], ["updated_at", "2015-11-24 11:38:55.576302"], ["id", 1]]
---
	def update
		@wiki = Wiki.find(params[:id])

		if @wiki.update_attributes(wiki_params)